In [27]:
import pandas as pd

In [30]:
frame = pd.read_csv('data.csv', header=0)

In [31]:
frame

                    Name\tBirth\tCity\tPosition
0             Иванов А.А.\t22.03.1980\tМосква\t
1  Сорокин И.В.\t07.08.1965\tВолгоград\tинженер
2      Белов М.М.\t13.02.1980\tРостов\tменеджер
3         Мельникова Д.С.\t15.04.1985\tРостов\t
4      Рыбина Е.П.\t19.11.1985\tМосква\tинженер
5      Костров С.О.\t31.05.1985\tМосква\tстажер

In [32]:
frame.dtypes

Name\tBirth\tCity\tPosition    object
dtype: object

In [33]:
frame = pd.read_csv('data.csv', header=0, sep='\t')

In [34]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [35]:
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [36]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [37]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [38]:
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [39]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 272.0+ bytes

In [40]:
frame.fillna("разнорабочий", inplace=True)

In [41]:
frame

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [42]:
frame.Position

0    разнорабочий
1         инженер
2        менеджер
3    разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

In [43]:
frame[["Position"]]

       Position
0  разнорабочий
1       инженер
2      менеджер
3  разнорабочий
4       инженер
5        стажер

In [44]:
frame[["Name", "Position"]]

              Name      Position
0      Иванов А.А.  разнорабочий
1     Сорокин И.В.       инженер
2       Белов М.М.      менеджер
3  Мельникова Д.С.  разнорабочий
4      Рыбина Е.П.       инженер
5     Костров С.О.        стажер

In [45]:
frame.head()

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер

In [46]:
frame[:3]

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [47]:
frame.loc?

In [48]:
frame.loc([1, 3, 5], ["Name", "City"])

TypeError: __call__() takes from 1 to 2 positional arguments but 3 were given

In [49]:
frame.loc[[1, 3, 5], ["Name", "City"]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [50]:
frame.iloc[[1, 3, 5], [0, 2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [51]:
frame.ix[[1, 3, 5], ["Name", "City"]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [52]:
frame.ix[[1, 3, 5], [0, 2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [53]:
frame[frame.Birth >= pd.datetime(1985, 1, 1)]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [54]:
frame.Birth >= pd.datetime(1985, 1, 1)

0    False
1    False
2    False
3     True
4     True
5     True
Name: Birth, dtype: bool

In [55]:
frame[(frame.Birth >= pd.datetime(1985, 1, 1))&(frame.City != 'Москва')]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий

In [56]:
frame[(frame.Birth >= pd.datetime(1985, 1, 1))|(frame.City != 'Москва')]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер